brew "bat"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "git"
brew "gnu-tar"
brew "grep"
brew "htop"
brew "jq"
brew "less"
brew "neofetch"
brew "neovim"
brew "shellcheck"
brew "telnet"
brew "tmux"
brew "tree"
brew "zsh"

# https://alexos.dev/2022/01/02/docker-desktop-alternatives-for-m1-mac/
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "colima"
