# Bootstrap: install basic package using homebrew.
# See [1] for details.
#
# [1]: https://docs.brew.sh/Brew-Bundle-and-Brewfile

brew "bat"
brew "bcrypt"
brew "cups"
brew "exiftool"
brew "git"
brew "htop"
brew "imagemagick"
brew "jq"
brew "less"
brew "neofetch"
brew "neovim"
brew "shellcheck"
brew "telnet" if OS.mac?
brew "tmux"
brew "tree"
brew "zsh"

# better binary from GNU
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gawk" if OS.mac?
brew "gnu-tar"
brew "grep"

# https://alexos.dev/2022/01/02/docker-desktop-alternatives-for-m1-mac/
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "colima" if OS.mac?

# gpg-related
brew "gnupg" if OS.mac?
brew "pinentry" if OS.mac?

# engineering-related
brew "ansible"
brew "ansible-lint"
brew "go"

# desktop app, macos only
cask "alacritty", args: { no_quarantine: true }
cask "discord"
cask "firefox"
cask "google-chrome"
cask "visual-studio-code"
cask "whatsapp"

# macos-specific app
brew "mas" if OS.mac?
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
